In [1]:
# Import modules
import pandas as pd
from pathlib import Path

In [2]:
# Load the CSV file
csv_file = Path("Dataset/salaries.csv")
salaries_df = pd.read_csv(csv_file)

# Display sample data
salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,EN,FT,Data Analyst,75000,USD,75000,US,100,US,M
1,2023,EN,FT,Data Analyst,60000,USD,60000,US,100,US,M
2,2023,MI,FT,Analytics Engineer,185700,USD,185700,US,0,US,M
3,2023,MI,FT,Analytics Engineer,165000,USD,165000,US,0,US,M
4,2023,SE,FT,Data Engineer,160000,USD,160000,US,100,US,M

In [3]:
# Check for missing data
salaries_df.count()

work_year             3006
experience_level      3006
employment_type       3006
job_title             3006
salary                3006
salary_currency       3006
salary_in_usd         3006
employee_residence    3006
remote_ratio          3006
company_location      3006
company_size          3006
dtype: int64

In [4]:
# Identify type of data
salaries_df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [5]:
# Select companies locate in US
us_df = salaries_df.loc[salaries_df["company_location"]=="US",:]
us_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,EN,FT,Data Analyst,75000,USD,75000,US,100,US,M
1,2023,EN,FT,Data Analyst,60000,USD,60000,US,100,US,M
2,2023,MI,FT,Analytics Engineer,185700,USD,185700,US,0,US,M
3,2023,MI,FT,Analytics Engineer,165000,USD,165000,US,0,US,M
4,2023,SE,FT,Data Engineer,160000,USD,160000,US,100,US,M